---
kind: method
id: M:Autodesk.Revit.DB.Electrical.InsulationTypeSet.GetEnumerator
source: html/ce6423c5-00f2-6d85-f66a-47aebf5a51d6.htm
---
# Autodesk.Revit.DB.Electrical.InsulationTypeSet.GetEnumerator Method

Retrieve a forward moving iterator to the set.

## Syntax (C#)
```csharp
public virtual IEnumerator GetEnumerator()
```

## Returns
Returns a forward moving iterator to the set.